notes/sept11/sept11.org
#+html_head: <link rel="stylesheet" type="text/css" href="../../htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../readtheorg.css"/>
#+html_head: <script src="../../jquery.min.js"></script>
#+html_head: <script src="../../bootstrap.min.js"></script>
#+html_head: <script type="text/javascript" src="../../readtheorg.js"></script>

#+Author: Julian Grove
#+Title: Haskell: type classes and higher-order polymorphism
#+bibliography: ../../ur-comp-sem-2023.bib

* Review
** ~Maybe~
   A commonly used data type in Haskell is ~Maybe a~:
   #+begin_src haskell
     data Maybe a = Just a | Nothing deriving (Show, Eq)
   #+end_src
   ~Maybe a~ is like the data type ~a~ on its own, but with extra information about
   whether the a computational succeeded for failed.

** Key-value pairs
   As an example, say we have the following type representing a table of
   key-value pairs, with ~String~ being the type of the key and ~Integer~ being the
   type of the value:
   #+begin_src haskell
     type Table = [(String, Integer)]
   #+end_src
   Then, we can define a function for looking up the value associated with any
   given key, as follows:
   #+begin_src haskell
     lookUp :: String -> Table -> Maybe Integer
     lookUp s [] = Nothing
     lookUp s ((s', i) : t) = if s' == s then Just i  else lookUp s t
   #+end_src
   For instance, given the following table
   #+begin_src haskell
     yearFounded :: Table
     yearFounded =
       [ ("The Smiths", 1982)
       , ("Joy Division", 1976)
       , ("New Order", 1980) ]
   #+end_src
   one could do
   #+begin_src haskell
     ghci> lookUp "The Smiths" yearFounded
     Just 1982
     ghci> lookUp "The Stone Roses" yearFounded
     Nothing
   #+end_src
   Importantly, no actual exception was thrown when I tried to look up ~"TheStone
   Roses"~. Instead, ~lookUp~ returned a value, ~Nothing~, inhabitting the data type
   ~Maybe Integer~.

   One way to think of the ~Maybe a~ data type is that it represents an action
   your computer can perform---throwing an error---as data. This illustrates
   what in Haskell is a pretty commonly used technique of bluring the lines
   between /effects/ and data.

** ~div~
   Let's look at the function
   #+begin_src haskell
   div :: Integer -> Integer -> Integer
   #+end_src
   which behaves as follows:
   #+begin_src haskell
     ghci> div 4 2
     2
     ghci> div 4 0
     *** Exception: divide by zero
   #+end_src
   ~div~ is a partial function; it is only defined when its second argument is not
   ~0~.

   A total version of ~div~ would be the following function ~safeDiv~ which uses
   maybe types:
   #+begin_src haskell
     safeDiv :: Integer -> Integer -> Maybe Integer
     safeDiv m n = if n == 0 then Nothing else Just (div m n)
   #+end_src

** ~Either~
   A generalization of ~Maybe a~ is the data type ~Either a b~:
   #+begin_src haskell
     data Either a b = Left a | Right b deriving (Show, Eq)
   #+end_src
   Here, ~Left~ means failure, and ~Right~ means success. ~Either~ types are a
   generalization of ~Maybe~ types, in the sense that we could encode ~Maybe~ as:
   #+begin_src haskell
     type Maybe' a = Either () a
     nothing' :: Maybe' a
     nothing' = Left ()
     just' :: Maybe a
     just' = Right
   #+end_src

** Type classes
   Type classes are one of the most famous distinguishing features of
   Haskell. A type class allows you to provide multiple implementations of what
   looks like the same function on different types. These implementations are
   called /instances/. Here are some examples:

