notes/sept11/sept11.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-11 Mon 17:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Haskell: type classes and higher-order polymorphism</title>
<meta name="author" content="Julian Grove" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Haskell: type classes and higher-order polymorphism</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb7d5a18">1. Review</a>
<ul>
<li><a href="#org99397a5">1.1. <code>Maybe</code></a></li>
<li><a href="#org90b3cf3">1.2. Key-value pairs</a></li>
<li><a href="#org859cdac">1.3. <code>div</code></a></li>
<li><a href="#org4e5defc">1.4. <code>Either</code></a></li>
<li><a href="#org7b850fd">1.5. Type classes</a></li>
<li><a href="#org9f74da1">1.6. <code>Show</code></a></li>
<li><a href="#org461ca6c">1.7. <code>Eq</code></a></li>
<li><a href="#org17ca05e">1.8. Declaring type classes</a></li>
<li><a href="#org62bba64">1.9. Kinds of polymorphism</a></li>
<li><a href="#org4e0e5ff">1.10. <code>Foldable</code></a></li>
<li><a href="#org53b63e8">1.11. <code>Functor</code></a></li>
</ul>
</li>
<li><a href="#orgda256ee">2. Exercises</a>
<ul>
<li><a href="#orgacde44b">2.1. Part 1</a></li>
<li><a href="#org3dcc6c1">2.2. Part 2</a></li>
<li><a href="#org9746648">2.3. Part 3</a></li>
<li><a href="#orgbe3bf21">2.4. Part 4</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb7d5a18" class="outline-2">
<h2 id="orgb7d5a18"><span class="section-number-2">1.</span> Review</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org99397a5" class="outline-3">
<h3 id="org99397a5"><span class="section-number-3">1.1.</span> <code>Maybe</code></h3>
<div class="outline-text-3" id="text-1-1">
<p>
A commonly used data type in Haskell is <code>Maybe a</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Maybe</span> a <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Just</span> a <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Nothing</span> <span style="color: #fb4933;">deriving</span> (<span style="color: #d3869b;">Show</span>, <span style="color: #d3869b;">Eq</span>)
</pre>
</div>
<p>
<code>Maybe a</code> is like the data type <code>a</code> on its own, but with extra information about
whether the a computational succeeded for failed.
</p>
</div>
</div>

<div id="outline-container-org90b3cf3" class="outline-3">
<h3 id="org90b3cf3"><span class="section-number-3">1.2.</span> Key-value pairs</h3>
<div class="outline-text-3" id="text-1-2">
<p>
As an example, say we have the following type representing a table of
key-value pairs, with <code>String</code> being the type of the key and <code>Integer</code> being the
type of the value:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">type</span> <span style="color: #d3869b;">Table</span> <span style="color: #83a598;">=</span> [(<span style="color: #d3869b;">String</span>, <span style="color: #d3869b;">Integer</span>)]
</pre>
</div>
<p>
Then, we can define a function for looking up the value associated with any
given key, as follows:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">lookUp</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">String</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Table</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Maybe</span> <span style="color: #d3869b;">Integer</span>
<span style="color: #fabd2f;">lookUp</span> s <span style="color: #d3869b;">[]</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Nothing</span>
<span style="color: #fabd2f;">lookUp</span> s ((s', i) <span style="color: #d3869b;">:</span> t) <span style="color: #83a598;">=</span> <span style="color: #fb4933;">if</span> s' <span style="color: #83a598;">==</span> s <span style="color: #fb4933;">then</span> <span style="color: #d3869b;">Just</span> i  <span style="color: #fb4933;">else</span> lookUp s t
</pre>
</div>
<p>
For instance, given the following table
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">yearFounded</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Table</span>
<span style="color: #fabd2f;">yearFounded</span> <span style="color: #83a598;">=</span>
  [ (<span style="color: #b8bb26;">"The Smiths"</span>, 1982)
  , (<span style="color: #b8bb26;">"Joy Division"</span>, 1976)
  , (<span style="color: #b8bb26;">"New Order"</span>, 1980) ]
</pre>
</div>
<p>
one could do
</p>
<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #fabd2f;">&gt;</span> lookUp <span style="color: #b8bb26;">"The Smiths"</span> yearFounded
<span style="color: #d3869b;">Just</span> 1982
ghci<span style="color: #fabd2f;">&gt;</span> lookUp <span style="color: #b8bb26;">"The Stone Roses"</span> yearFounded
<span style="color: #d3869b;">Nothing</span>
</pre>
</div>
<p>
Importantly, no actual exception was thrown when I tried to look up <code>"TheStone
   Roses"</code>. Instead, <code>lookUp</code> returned a value, <code>Nothing</code>, inhabitting the data type
<code>Maybe Integer</code>.
</p>

<p>
One way to think of the <code>Maybe a</code> data type is that it represents an action
your computer can perform&#x2014;throwing an error&#x2014;as data. This illustrates
what in Haskell is a pretty commonly used technique of bluring the lines
between <i>effects</i> and data.
</p>
</div>
</div>

<div id="outline-container-org859cdac" class="outline-3">
<h3 id="org859cdac"><span class="section-number-3">1.3.</span> <code>div</code></h3>
<div class="outline-text-3" id="text-1-3">
<p>
Let's look at the function
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">div</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Integer</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Integer</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Integer</span>
</pre>
</div>
<p>
which behaves as follows:
</p>
<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #fabd2f;">&gt;</span> div 4 2
2
ghci<span style="color: #fabd2f;">&gt;</span> div 4 0
<span style="color: #83a598;">***</span> <span style="color: #d3869b;">Exception:</span> divide by zero
</pre>
</div>
<p>
<code>div</code> is a partial function; it is only defined when its second argument is not
<code>0</code>.
</p>

<p>
A total version of <code>div</code> would be the following function <code>safeDiv</code> which uses
maybe types:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">safeDiv</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Integer</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Integer</span> <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Maybe</span> <span style="color: #d3869b;">Integer</span>
<span style="color: #fabd2f;">safeDiv</span> m n <span style="color: #83a598;">=</span> <span style="color: #fb4933;">if</span> n <span style="color: #83a598;">==</span> 0 <span style="color: #fb4933;">then</span> <span style="color: #d3869b;">Nothing</span> <span style="color: #fb4933;">else</span> <span style="color: #d3869b;">Just</span> (div m n)
</pre>
</div>
</div>
</div>

<div id="outline-container-org4e5defc" class="outline-3">
<h3 id="org4e5defc"><span class="section-number-3">1.4.</span> <code>Either</code></h3>
<div class="outline-text-3" id="text-1-4">
<p>
A generalization of <code>Maybe a</code> is the data type <code>Either a b</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Either</span> a b <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Left</span> a <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Right</span> b <span style="color: #fb4933;">deriving</span> (<span style="color: #d3869b;">Show</span>, <span style="color: #d3869b;">Eq</span>)
</pre>
</div>
<p>
Here, <code>Left</code> means failure, and <code>Right</code> means success. <code>Either</code> types are a
generalization of <code>Maybe</code> types, in the sense that we could encode <code>Maybe</code> as:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">type</span> <span style="color: #d3869b;">Maybe'</span> a <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Either</span> <span style="color: #d3869b;">()</span> a
<span style="color: #fabd2f;">nothing'</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Maybe'</span> a
<span style="color: #fabd2f;">nothing'</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Left</span> <span style="color: #d3869b;">()</span>
<span style="color: #fabd2f;">just'</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Maybe</span> a
<span style="color: #fabd2f;">just'</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Right</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7b850fd" class="outline-3">
<h3 id="org7b850fd"><span class="section-number-3">1.5.</span> Type classes</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Type classes are one of the most famous distinguishing features of
Haskell. A type class allows you to provide multiple implementations of what
looks like the same function on different types. These implementations are
called <i>instances</i>. Here are some examples:
</p>
</div>
</div>
