notes/sept11/sept11.org
** ~Show~
   We have already seen type classes when we've used ~deriving Show~ in data type
   declarations. But we can actually implement ~Show~ instances ourselves. Imagine
   that we defined a new data type ~Table~ (instead of merely using ~Table~ as a
   type alias):
   #+begin_src haskell
     data Table = Table [(String, Integer)] deriving (Show, Eq)
   #+end_src
   Given the following declaration of the type class ~Show~:
   #+begin_src haskell
     class Show a where
       show :: a -> String
   #+end_src
   we may define the ~Table~ instance of ~Show~ as follows:
   #+begin_src haskell
     instance Show Table where
       show (Table []) = "Empty Table"
       show (Table [(b, y)]) = b ++ " : " ++ show y
       show (Table ((b, y) : t)) = b ++ " : " ++ show y ++ " | " ++ show (Table t)
   #+end_src
   This will give us the following behavior, for example:
   #+begin_src haskell
     ghci> Table [("The Smiths", 1982), ("Joy Division", 1976)]
     The Smiths : 1982 | Joy Division : 1976
   #+end_src
   
** ~Eq~
   Another useful type class is ~Eq~:
   #+begin_src haskell
     class Eq a where
       (==) :: a -> a -> Bool
       (/=) :: a -> a -> Bool
       a /= b = not (a == b)
   #+end_src
   Like ~Show~ instances, ~Eq~ instances can be derived. But we can also define our
   own ~Eq~ instances, e.g., for the ~Table~ data type:
   #+begin_src haskell
     instance Eq Table where
       Table a == Table b = a == b
   #+end_src

** Declaring type classes
   We can also declare our own type classes. To give an example of this, let's
   first define the following data types encoding some models of different
   personal computer brands from the 80s:
   #+begin_src haskell
     data Apple
       = IIc | IIe | GS 
       deriving (Show, Eq) 

     data IBM
       = PC | PCJr | XT | AT 
       deriving (Show, Eq) 

     data Commodore
       = C64 | C128 
       deriving (Show, Eq)
   #+end_src
   Let's say we want to define a type class which, given a brand, provides a
   function that determines which reboot keys are available for each of its
   models. Given the following data type ~Key~
   #+begin_src haskell
     data Key  
       = Ctrl 
       | Alt 
       | Del 
       | Option 
       | Apple 
       | Reset 
       | PowerButton 
       deriving (Show, Eq)
   #+end_src
   we can declare a type class ~Rebootable~:
   #+begin_src haskell
     class Rebootable a where
       rebootKeys :: a -> [Key]
   #+end_src
   And then we can declare the following instances:
   #+begin_src haskell
     instance Rebootable IBM where 
       rebootKeys _ = [Ctrl, Alt, Del]
  
     instance Rebootable Apple where 
       rebootKeys _ = [Ctrl, Option, Reset] 

     instance Rebootable Commodore where 
       rebootKeys C64 = [PowerButton] 
       rebootKeys C128 = [Reset]
   #+end_src
   Each of these instances of ~Rebootable~ determines how to map any model onto a
   list of keys for some brand.
   
** Kinds of polymorphism
   Each of the type classes we've looked at provide what is known as /ad hoc
   polymorphism/. This polymorphism is /ad hoc/ because only some data types need
   provide instances for the relevant type variable (e.g., the ~a~ in ~Show a~). In
   addition, different instances can have fundamentally /different/ definitions
   from each other.

   Ad hoc polymorphism is therefore contrasted with /parametric polymorphism/,
   which has the following features:
   - We can't constrain the instantiating data type ahead of time.
   - Parametric polymorphic functions come in families all of whose members act
     fundamentally /the same way/.

  Examples of parametric polymorphism are the functions on lists ~map~, ~filter~,
  ~foldl~, and ~foldr~. In general, it doesn't matter /what type of data/ any given
  list holds; these functions will behave the same on that list, regardless.

  Now, for a couple more important type classes...
     
