notes/sept11/sept11.html

<div id="outline-container-org9f74da1" class="outline-3">
<h3 id="org9f74da1"><span class="section-number-3">1.6.</span> <code>Show</code></h3>
<div class="outline-text-3" id="text-1-6">
<p>
We have already seen type classes when we've used <code>deriving Show</code> in data type
declarations. But we can actually implement <code>Show</code> instances ourselves. Imagine
that we defined a new data type <code>Table</code> (instead of merely using <code>Table</code> as a
type alias):
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Table</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Table</span> [(<span style="color: #d3869b;">String</span>, <span style="color: #d3869b;">Integer</span>)] <span style="color: #fb4933;">deriving</span> (<span style="color: #d3869b;">Show</span>, <span style="color: #d3869b;">Eq</span>)
</pre>
</div>
<p>
Given the following declaration of the type class <code>Show</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">class</span> <span style="color: #d3869b;">Show</span> a <span style="color: #fb4933;">where</span>
  show <span style="color: #83a598;">::</span> a <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">String</span>
</pre>
</div>
<p>
we may define the <code>Table</code> instance of <code>Show</code> as follows:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">instance</span> <span style="color: #d3869b;">Show</span> <span style="color: #d3869b;">Table</span> <span style="color: #fb4933;">where</span>
  show (<span style="color: #d3869b;">Table</span> <span style="color: #d3869b;">[]</span>) <span style="color: #83a598;">=</span> <span style="color: #b8bb26;">"Empty Table"</span>
  show (<span style="color: #d3869b;">Table</span> [(b, y)]) <span style="color: #83a598;">=</span> b <span style="color: #83a598;">++</span> <span style="color: #b8bb26;">" : "</span> <span style="color: #83a598;">++</span> show y
  show (<span style="color: #d3869b;">Table</span> ((b, y) <span style="color: #d3869b;">:</span> t)) <span style="color: #83a598;">=</span> b <span style="color: #83a598;">++</span> <span style="color: #b8bb26;">" : "</span> <span style="color: #83a598;">++</span> show y <span style="color: #83a598;">++</span> <span style="color: #b8bb26;">" | "</span> <span style="color: #83a598;">++</span> show (<span style="color: #d3869b;">Table</span> t)
</pre>
</div>
<p>
This will give us the following behavior, for example:
</p>
<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #fabd2f;">&gt;</span> <span style="color: #d3869b;">Table</span> [(<span style="color: #b8bb26;">"The Smiths"</span>, 1982), (<span style="color: #b8bb26;">"Joy Division"</span>, 1976)]
<span style="color: #d3869b;">The</span> <span style="color: #d3869b;">Smiths</span> <span style="color: #d3869b;">:</span> 1982 <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Joy</span> <span style="color: #d3869b;">Division</span> <span style="color: #d3869b;">:</span> 1976
</pre>
</div>
</div>
</div>

<div id="outline-container-org461ca6c" class="outline-3">
<h3 id="org461ca6c"><span class="section-number-3">1.7.</span> <code>Eq</code></h3>
<div class="outline-text-3" id="text-1-7">
<p>
Another useful type class is <code>Eq</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">class</span> <span style="color: #d3869b;">Eq</span> a <span style="color: #fb4933;">where</span>
  (<span style="color: #83a598;">==</span>) <span style="color: #83a598;">::</span> a <span style="color: #83a598;">-&gt;</span> a <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Bool</span>
  (<span style="color: #83a598;">/=</span>) <span style="color: #83a598;">::</span> a <span style="color: #83a598;">-&gt;</span> a <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Bool</span>
  a <span style="color: #83a598;">/=</span> b <span style="color: #83a598;">=</span> not (a <span style="color: #83a598;">==</span> b)
</pre>
</div>
<p>
Like <code>Show</code> instances, <code>Eq</code> instances can be derived. But we can also define our
own <code>Eq</code> instances, e.g., for the <code>Table</code> data type:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">instance</span> <span style="color: #d3869b;">Eq</span> <span style="color: #d3869b;">Table</span> <span style="color: #fb4933;">where</span>
  <span style="color: #d3869b;">Table</span> a <span style="color: #83a598;">==</span> <span style="color: #d3869b;">Table</span> b <span style="color: #83a598;">=</span> a <span style="color: #83a598;">==</span> b
</pre>
</div>
</div>
</div>

<div id="outline-container-org17ca05e" class="outline-3">
<h3 id="org17ca05e"><span class="section-number-3">1.8.</span> Declaring type classes</h3>
<div class="outline-text-3" id="text-1-8">
<p>
We can also declare our own type classes. To give an example of this, let's
first define the following data types encoding some models of different
personal computer brands from the 80s:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Apple</span>
  <span style="color: #83a598;">=</span> <span style="color: #d3869b;">IIc</span> <span style="color: #83a598;">|</span> <span style="color: #d3869b;">IIe</span> <span style="color: #83a598;">|</span> <span style="color: #d3869b;">GS</span> 
  <span style="color: #fb4933;">deriving</span> (<span style="color: #d3869b;">Show</span>, <span style="color: #d3869b;">Eq</span>) 

<span style="color: #fb4933;">data</span> <span style="color: #d3869b;">IBM</span>
  <span style="color: #83a598;">=</span> <span style="color: #d3869b;">PC</span> <span style="color: #83a598;">|</span> <span style="color: #d3869b;">PCJr</span> <span style="color: #83a598;">|</span> <span style="color: #d3869b;">XT</span> <span style="color: #83a598;">|</span> <span style="color: #d3869b;">AT</span> 
  <span style="color: #fb4933;">deriving</span> (<span style="color: #d3869b;">Show</span>, <span style="color: #d3869b;">Eq</span>) 

<span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Commodore</span>
  <span style="color: #83a598;">=</span> <span style="color: #d3869b;">C64</span> <span style="color: #83a598;">|</span> <span style="color: #d3869b;">C128</span> 
  <span style="color: #fb4933;">deriving</span> (<span style="color: #d3869b;">Show</span>, <span style="color: #d3869b;">Eq</span>)
</pre>
</div>
<p>
Let's say we want to define a type class which, given a brand, provides a
function that determines which reboot keys are available for each of its
models. Given the following data type <code>Key</code>
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Key</span>  
  <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Ctrl</span> 
  <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Alt</span> 
  <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Del</span> 
  <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Option</span> 
  <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Apple</span> 
  <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Reset</span> 
  <span style="color: #83a598;">|</span> <span style="color: #d3869b;">PowerButton</span> 
  <span style="color: #fb4933;">deriving</span> (<span style="color: #d3869b;">Show</span>, <span style="color: #d3869b;">Eq</span>)
</pre>
</div>
<p>
we can declare a type class <code>Rebootable</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">class</span> <span style="color: #d3869b;">Rebootable</span> a <span style="color: #fb4933;">where</span>
  rebootKeys <span style="color: #83a598;">::</span> a <span style="color: #83a598;">-&gt;</span> [<span style="color: #d3869b;">Key</span>]
</pre>
</div>
<p>
And then we can declare the following instances:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">instance</span> <span style="color: #d3869b;">Rebootable</span> <span style="color: #d3869b;">IBM</span> <span style="color: #fb4933;">where</span> 
  rebootKeys <span style="color: #fb4933;">_</span> <span style="color: #83a598;">=</span> [<span style="color: #d3869b;">Ctrl</span>, <span style="color: #d3869b;">Alt</span>, <span style="color: #d3869b;">Del</span>]

<span style="color: #fb4933;">instance</span> <span style="color: #d3869b;">Rebootable</span> <span style="color: #d3869b;">Apple</span> <span style="color: #fb4933;">where</span> 
  rebootKeys <span style="color: #fb4933;">_</span> <span style="color: #83a598;">=</span> [<span style="color: #d3869b;">Ctrl</span>, <span style="color: #d3869b;">Option</span>, <span style="color: #d3869b;">Reset</span>] 

<span style="color: #fb4933;">instance</span> <span style="color: #d3869b;">Rebootable</span> <span style="color: #d3869b;">Commodore</span> <span style="color: #fb4933;">where</span> 
  rebootKeys <span style="color: #d3869b;">C64</span> <span style="color: #83a598;">=</span> [<span style="color: #d3869b;">PowerButton</span>] 
  rebootKeys <span style="color: #d3869b;">C128</span> <span style="color: #83a598;">=</span> [<span style="color: #d3869b;">Reset</span>]
</pre>
</div>
<p>
Each of these instances of <code>Rebootable</code> determines how to map any model onto a
list of keys for some brand.
</p>
</div>
</div>

<div id="outline-container-org62bba64" class="outline-3">
<h3 id="org62bba64"><span class="section-number-3">1.9.</span> Kinds of polymorphism</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Each of the type classes we've looked at provide what is known as <i>ad hoc
polymorphism</i>. This polymorphism is <i>ad hoc</i> because only some data types need
provide instances for the relevant type variable (e.g., the <code>a</code> in <code>Show a</code>). In
addition, different instances can have fundamentally <i>different</i> definitions
from each other.
</p>

<p>
Ad hoc polymorphism is therefore contrasted with <i>parametric polymorphism</i>,
which has the following features:
</p>
<ul class="org-ul">
<li>We can't constrain the instantiating data type ahead of time.</li>
<li>Parametric polymorphic functions come in families all of whose members act
fundamentally <i>the same way</i>.</li>
</ul>

<p>
Examples of parametric polymorphism are the functions on lists <code>map</code>, <code>filter</code>,
<code>foldl</code>, and <code>foldr</code>. In general, it doesn't matter <i>what type of data</i> any given
list holds; these functions will behave the same on that list, regardless.
</p>

<p>
Now, for a couple more important type classes&#x2026;
</p>
</div>
</div>
