notes/sept11/sept11.org
** ~Foldable~
   ~foldr~ and ~foldl~ are actually methods of a type class ~Foldable~:
   #+begin_src haskell
     class Foldable t where
       foldl :: (b -> a -> b) -> b -> t a -> b
       foldr :: (a -> b -> b) -> b -> t a -> b
   #+end_src
   Thus lists aren't the only things which are foldable; for example, ~Maybe~ is,
   as well:
   #+begin_src haskell
     instance Foldable Maybe where
       foldl f b Nothing = b
       foldl f b (Just a) = f b a
       foldr f b Nothing = b
       foldr f b (Just a) = f a b
   #+end_src

** ~Functor~
   Functors provide another class, with a single method ~fmap~:
   #+begin_src haskell
     class Functor f where
       fmap :: (a -> b) -> f a -> f b
   #+end_src
   Importantly, ~fmap~ is expected to satisfy certain laws (the ~Functor~ laws):
   #+begin_src haskell
     -- fmap id = id -- Identity
     -- fmap (f . g) = fmap f . fmap g -- Composition
   #+end_src
   Here, ~(.)~ is /function composition/, i.e.:
   #+begin_src haskell
     (f . g) x = f (g x)
   #+end_src
   What these laws effectively say, therefore, is that turning a function ~g :: a
   -> b~ into a function ~fmap g :: f a -> f b~ on data which has been /lifted/ into
   the functor via ~f~ doesn't fiddle with the identity function and isn't
   sensitive to whether you have composed two functions /before/ or /after/ doing
   the lifting.

   For some examples, we have the following instances of the class ~Functor~:
   #+begin_src haskell
     instance Functor [] where
       fmap = map

     instance Functor Maybe where
       fmap f (Just a) = Just (f a)
       fmap f Nothing = Nothing

     instance Functor (Either a) where
       fmap f (Left a) = Left a
       fmap f (Right b) = Right (f b)
   #+end_src

* Exercises
** Part 1
   Let's define the new data type ~Tree a~, which packages inhabitants of any type
   ~a~ up into a tree-like data structure:
   #+begin_src haskell
     data Tree a = Empty | Leaf a | Node a (Tree a) (Tree a) deriving (Eq, Show)
   #+end_src
   In words, a ~Tree a~ can be either ~Empty~ (it can store nothing), a ~Leaf a~ (it
   can store exactly one thing of type ~a~, or a ~Node a (Tree a) (Tree a)~ (it can
   store one thing of type ~a~, and may also branch into two more trees
   constituting its left and right daughters).

   For example, let's say we wanted to represent a tree that holds data of type
   ~Integer~. We could define the following tree
   #+begin_src haskell
     exampleTree :: Tree Integer
     exampleTree = Node 1 (Leaf 2) (Node 3 (Leaf 4) Empty)
   #+end_src
   which represents the following tree:
   #+begin_example
          1
	 _|_
	|   |
	2   3
	   _|_
	  |   |
	  4
   #+end_example
   Write a function
   #+begin_src haskell
     depth :: Tree a -> Integer
   #+end_src
   which, given a ~Tree a~, returns the longest path from its root to one of its
   leaves. For example, ~depth~ should behave as follows:
   #+begin_src haskell
     ghci> depth exampleTree
     3
     ghci> depth Empty
     0
     ghci> depth (Leaf 7)
     1
   #+end_src


** Part 2
   Make ~Tree~ an instance of the class ~Functor~. Does the instance you provide
   satisfy the ~Functor~ laws?

** Part 3
   Make ~Tree~ an instance of the class ~Foldable~. You have different options here,
   in principle. I really just want you to make sure that the answer you provide
   is well typed! 

** Part 4
   Write a definition of ~depth~ that invokes ~foldl~ or ~foldr~ (and possibly ~fmap~,
   if you like)!
