notes/sept11/sept11.html

<div id="outline-container-org4e0e5ff" class="outline-3">
<h3 id="org4e0e5ff"><span class="section-number-3">1.10.</span> <code>Foldable</code></h3>
<div class="outline-text-3" id="text-1-10">
<p>
<code>foldr</code> and <code>foldl</code> are actually methods of a type class <code>Foldable</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">class</span> <span style="color: #d3869b;">Foldable</span> t <span style="color: #fb4933;">where</span>
  foldl <span style="color: #83a598;">::</span> (b <span style="color: #83a598;">-&gt;</span> a <span style="color: #83a598;">-&gt;</span> b) <span style="color: #83a598;">-&gt;</span> b <span style="color: #83a598;">-&gt;</span> t a <span style="color: #83a598;">-&gt;</span> b
  foldr <span style="color: #83a598;">::</span> (a <span style="color: #83a598;">-&gt;</span> b <span style="color: #83a598;">-&gt;</span> b) <span style="color: #83a598;">-&gt;</span> b <span style="color: #83a598;">-&gt;</span> t a <span style="color: #83a598;">-&gt;</span> b
</pre>
</div>
<p>
Thus lists aren't the only things which are foldable; for example, <code>Maybe</code> is,
as well:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">instance</span> <span style="color: #d3869b;">Foldable</span> <span style="color: #d3869b;">Maybe</span> <span style="color: #fb4933;">where</span>
  foldl f b <span style="color: #d3869b;">Nothing</span> <span style="color: #83a598;">=</span> b
  foldl f b (<span style="color: #d3869b;">Just</span> a) <span style="color: #83a598;">=</span> f b a
  foldr f b <span style="color: #d3869b;">Nothing</span> <span style="color: #83a598;">=</span> b
  foldr f b (<span style="color: #d3869b;">Just</span> a) <span style="color: #83a598;">=</span> f a b
</pre>
</div>
</div>
</div>

<div id="outline-container-org53b63e8" class="outline-3">
<h3 id="org53b63e8"><span class="section-number-3">1.11.</span> <code>Functor</code></h3>
<div class="outline-text-3" id="text-1-11">
<p>
Functors provide another class, with a single method <code>fmap</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">class</span> <span style="color: #d3869b;">Functor</span> f <span style="color: #fb4933;">where</span>
  fmap <span style="color: #83a598;">::</span> (a <span style="color: #83a598;">-&gt;</span> b) <span style="color: #83a598;">-&gt;</span> f a <span style="color: #83a598;">-&gt;</span> f b
</pre>
</div>
<p>
Importantly, <code>fmap</code> is expected to satisfy certain laws (the <code>Functor</code> laws):
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #928374;">-- </span><span style="color: #928374;">fmap id = id -- Identity</span>
<span style="color: #928374;">-- </span><span style="color: #928374;">fmap (f . g) = fmap f . fmap g -- Composition</span>
</pre>
</div>
<p>
Here, <code>(.)</code> is <i>function composition</i>, i.e.:
</p>
<div class="org-src-container">
<pre class="src src-haskell">(f <span style="color: #83a598;">.</span> g) x <span style="color: #83a598;">=</span> f (g x)
</pre>
</div>
<p>
What these laws effectively say, therefore, is that turning a function <code>g :: a
   -&gt; b</code> into a function <code>fmap g :: f a -&gt; f b</code> on data which has been <i>lifted</i> into
the functor via <code>f</code> doesn't fiddle with the identity function and isn't
sensitive to whether you have composed two functions <i>before</i> or <i>after</i> doing
the lifting.
</p>

<p>
For some examples, we have the following instances of the class <code>Functor</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">instance</span> <span style="color: #d3869b;">Functor</span> <span style="color: #d3869b;">[]</span> <span style="color: #fb4933;">where</span>
  fmap <span style="color: #83a598;">=</span> map

<span style="color: #fb4933;">instance</span> <span style="color: #d3869b;">Functor</span> <span style="color: #d3869b;">Maybe</span> <span style="color: #fb4933;">where</span>
  fmap f (<span style="color: #d3869b;">Just</span> a) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Just</span> (f a)
  fmap f <span style="color: #d3869b;">Nothing</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Nothing</span>

<span style="color: #fb4933;">instance</span> <span style="color: #d3869b;">Functor</span> (<span style="color: #d3869b;">Either</span> a) <span style="color: #fb4933;">where</span>
  fmap f (<span style="color: #d3869b;">Left</span> a) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Left</span> a
  fmap f (<span style="color: #d3869b;">Right</span> b) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Right</span> (f b)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgda256ee" class="outline-2">
<h2 id="orgda256ee"><span class="section-number-2">2.</span> Exercises</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgacde44b" class="outline-3">
<h3 id="orgacde44b"><span class="section-number-3">2.1.</span> Part 1</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Let's define the new data type <code>Tree a</code>, which packages inhabitants of any type
<code>a</code> up into a tree-like data structure:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Tree</span> a <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Empty</span> <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Leaf</span> a <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Node</span> a (<span style="color: #d3869b;">Tree</span> a) (<span style="color: #d3869b;">Tree</span> a) <span style="color: #fb4933;">deriving</span> (<span style="color: #d3869b;">Eq</span>, <span style="color: #d3869b;">Show</span>)
</pre>
</div>
<p>
In words, a <code>Tree a</code> can be either <code>Empty</code> (it can store nothing), a <code>Leaf a</code> (it
can store exactly one thing of type <code>a</code>, or a <code>Node a (Tree a) (Tree a)</code> (it can
store one thing of type <code>a</code>, and may also branch into two more trees
constituting its left and right daughters).
</p>

<p>
For example, let's say we wanted to represent a tree that holds data of type
<code>Integer</code>. We could define the following tree
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">exampleTree</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Tree</span> <span style="color: #d3869b;">Integer</span>
<span style="color: #fabd2f;">exampleTree</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Node</span> 1 (<span style="color: #d3869b;">Leaf</span> 2) (<span style="color: #d3869b;">Node</span> 3 (<span style="color: #d3869b;">Leaf</span> 4) <span style="color: #d3869b;">Empty</span>)
</pre>
</div>
<p>
which represents the following tree:
</p>
<pre class="example" id="org983e686">
  1
 _|_
|   |
2   3
   _|_
  |   |
  4
</pre>
<p>
Write a function
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">depth</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Tree</span> a <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Integer</span>
</pre>
</div>
<p>
which, given a <code>Tree a</code>, returns the longest path from its root to one of its
leaves. For example, <code>depth</code> should behave as follows:
</p>
<div class="org-src-container">
<pre class="src src-haskell">ghci<span style="color: #fabd2f;">&gt;</span> depth exampleTree
3
ghci<span style="color: #fabd2f;">&gt;</span> depth <span style="color: #d3869b;">Empty</span>
0
ghci<span style="color: #fabd2f;">&gt;</span> depth (<span style="color: #d3869b;">Leaf</span> 7)
1
</pre>
</div>
</div>
</div>


<div id="outline-container-org3dcc6c1" class="outline-3">
<h3 id="org3dcc6c1"><span class="section-number-3">2.2.</span> Part 2</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Make <code>Tree</code> an instance of the class <code>Functor</code>. Does the instance you provide
satisfy the <code>Functor</code> laws?
</p>
</div>
</div>

<div id="outline-container-org9746648" class="outline-3">
<h3 id="org9746648"><span class="section-number-3">2.3.</span> Part 3</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Make <code>Tree</code> an instance of the class <code>Foldable</code>. You have different options here,
in principle. I really just want you to make sure that the answer you provide
is well typed! 
</p>
</div>
</div>

<div id="outline-container-orgbe3bf21" class="outline-3">
<h3 id="orgbe3bf21"><span class="section-number-3">2.4.</span> Part 4</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Write a definition of <code>depth</code> that invokes <code>foldl</code> or <code>foldr</code> (and possibly <code>fmap</code>,
if you like)!
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Julian Grove</p>
<p class="date">Created: 2023-09-11 Mon 17:19</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>